#upper()სტრინგში ყველა ასოს გარდაქმნის დიდ ასოდ. 
#lower()სტრინგში ყველა ასოს გარდაქმნის პატარა ასოდ.
#capitalize()სტრინგის მხოლოდ პირველ ასოს ხდის დიდს, დანარჩენს კი პატარას.
#find()ეძებს მითითებულ ტექსტს სტრინგში და აბრუნებს მის ადგილმდებარეობის (ინდექსის) ნომერს. თუ ვერ იპოვა, აბრუნებს -1-ს.  
#len()აბრუნებს ელემენტების რაოდენობას (სიგრძეს) სტრინგში, ლისტში და სხვა ობიექტებშიაბრუნებს ელემენტების რაოდენობას (სიგრძეს) სტრინგში, ლისტში და სხვა ობიექტებში  \
#insert()ამატებს ელემენტს ლისტში მითითებულ პოზიციაზე.             
#pop()შლის და აბრუნებს ლისტის ბოლო ელემენტს (ან მითითებულ ინდექსზე მყოფ ელემენტს).  
