# ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს კონკრეტულ მოქმედებას.
# ფუნქცია შეიძლება გამოვიძახოთ რამდენჯერაც დაგვჭირდება.

# print() არის ჩაშენებული (built-in) ფუნქცია.
# მისი დანიშნულებაა ეკრანზე ინფორმაციის (ტექსტის, რიცხვების და სხვა მონაცემების) გამოტანა.

# არგუმენტები არის მნიშვნელობები, რომლებსაც ფუნქციას გადავცემთ.
# მაგალითად, print("Hello")-ში "Hello" არის print() ფუნქციის არგუმენტი.

print("სახელი: გიორგი")
print("გვარი: ალაშვილი")
print("ასაკი: 16")
print("ქალაქი: თბილისი")
print("სასწავლო ადგილი: GOA - Goal-Oriented Academy")
print("უნარები: Python-ის საფუძვლები, გუნდური მუშაობა, პასუხისმგებლობა")
print("მიზანი: გავხდე პროფესიონალი პროგრამისტი და შევქმნა სასარგებლო პროგრამები.")