# სტრინგ მეთოდები გვეხმარება ტექსტების (string-ების) შეცვლაში და დამუშავებაში.
# მათი გამოყენებით შეგვიძლია:
# - ტექსტის გადიდება ან დაპატარავება
# - ასოების შეცვლა
# - ტექსტში ინფორმაციის მოძებნა
# - ტექსტის ნაწილებად დაყოფა        # upper()
# ყველა ასოს დიდ ასოდ აქცევს.

text = "hello"
print(text.upper())
# HELLO


# lower()
# ყველა ასოს პატარა ასოდ აქცევს.

text = "HELLO"
print(text.lower())
# hello


# capitalize()
# მხოლოდ პირველ ასოს ადიდებს.

text = "python"
print(text.capitalize())
# Python


# find()
# ეძებს კონკრეტულ ტექსტს და აბრუნებს მის ადგილს (index-ს).

text = "Hello World"
print(text.find("World"))  
# დოტ ნოტაცია (.) არის მეთოდის გამოძახების გზა.                                              
# წერტილის საშუალებით ვუკავშირებთ ობიექტს მის მეთოდს.

#მაგალითი

name = "nika"

print(name.upper())

# name არის ობიექტი
# upper() არის მისი მეთოდი
# . აკავშირებს მათ ერთმანეთს